app/Filters/Auth.php


        // fetch user information from the database using the decoded token
        $userModel = new \App\Models\UsersModel();
        $user = $userModel->where('email',$decoded->email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'nikohih348@minterp.com'
 LIMIT 1