app/Controllers/CommentsController.php

SELECT *
FROM `user`
WHERE `user`.`id` = '11'
---
     public function allComments($current_user,$task_id){
        // first check current user id is valid or not
        $response = service('response');
        $check_user = $this->user_model->find($current_user);