app/Controllers/LoginController.php

SELECT *
FROM `user`
WHERE `id` = '12'
---
    public function getProjectListForSingleUser($current_user){
        $response = service('response');
        // check provided user id is valid or not
        $user = $this->user_model->where('id',$current_user)->find();

SELECT *
FROM `user`
WHERE `user`.`id` = '11'
---
    public function countAllProjectForSingleUser($login_user){
        $response = service('response');
        // first check provided login user id is valid or not
        $check_user = $this->user_model->find($login_user);

SELECT *
FROM `user`
WHERE `user`.`id` = '69'
---
    public function getAllProjectListForSingleUser($current_user){
        $response = service('response');

        // for verify current_user id is valid
        $verify_user = $this->user_model->find($current_user);

SELECT *
FROM `user`
WHERE `user`.`id` = '11'
---
    public function getNotifications($current_user){
        $response = service('response');
        // check current user is valid or not
        $check_user = $this->user_model->find($current_user);

SELECT *
FROM `user`
WHERE `user`.`id` = '69'
---
    function getMyCurrentWork($current_user){
        $response = service('response');
        // first validate the current user is valid or not
        $check_user = $this->user_model->find($current_user);