app/Controllers/RegisterController.php

    public function listing(){
        $request = service('request');
        $response = service('response');
        $uri = service('uri');
          // get all value from uri query string
           $getdata =  $request->getGetPost();
           if (array_key_exists("limit",$getdata)){
             $data = $this->user_model->findAll($getdata['limit']);

           }else{
        $data = $this->user_model->findAll();
---
SELECT *
FROM `user`

    public function single($user_id){
        $response = service('response');

        $id = $this->user_model->find($user_id);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '10'