app/Controllers/ReportsController.php

SELECT *
FROM `user`
WHERE `id` = '10'
SELECT *
FROM `user`
WHERE `id` = '11'
---
public function getTimeEntries($current_user,$selected_user,$project_id){
      $response = service('response');
      // first check current user id' verification and also check its roles
      $verify_user = $this->user_model->where('id',$current_user)->find();
      if(!empty($verify_user)){

        // now check the user roles only allow to admin


       $user_roles = $verify_user[0]['roles'];

      if($user_roles === 'admin'|| $user_roles === 'manager'){
        // now check the selected user is valid or not
        $verify_selected_user = $this->user_model->where('id',$selected_user)->find();