app/Controllers/TaskController.php

SELECT *
FROM `user`
WHERE `user`.`id` = '12'
---
                        $staus = 404;
                    }else{
                        //check login id is valid or not
                        $check_user = $this->user_model->find($data['current_user']);

SELECT *
FROM `user`
WHERE `user`.`id` = '5'
---
            $sanitized_login_user = filter_var($login_user, FILTER_SANITIZE_NUMBER_INT);

            // first check the given id is valid or not \
            $check = $this->user_model->find($sanitized_login_user);