app/Models/CommentsModel.php

SELECT `task_assign`.`id` as `task_id`, `user`.`username` as `commentor`, `task_assign`.`created_at` as `comments_on`, `task_comments`
FROM `task_comments`
JOIN `user` ON `task_comments`.`task_commentor` = `user`.`id`
JOIN `task_assign` ON `task_comments`.`task_id` = `task_assign`.`id`
WHERE `task_id` = '44'
ORDER BY `task_comments`.`id` DESC
---
    public function getAllComments($task_id){
        $builder = $this->db->table('task_comments');
        $builder->select(['task_assign.id as task_id','user.username as commentor','task_assign.created_at as comments_on','task_comments']);
        $builder->join('user', 'task_comments.task_commentor = user.id');
        $builder->join('task_assign', 'task_comments.task_id = task_assign.id');
        $builder->where('task_id', $task_id);
        $builder->orderBy('task_comments.id', 'desc'); // sort by task_id in ascending order
        $query = $builder->get();