app/Models/CurrentWorkModel.php

public function getAllDataForToday($login_user, $today){
    $builder = $this->db->table('current_task');

    $builder->select('*');
    $builder->where('user_id', $login_user);
    $builder->where('insert_date', $today);
    $query = $builder->get();
---
SELECT *
FROM `current_task`
WHERE `user_id` = '69'
AND `insert_date` = '2023-05-24'