app/Models/NotificationModel.php

SELECT *
FROM `notifications`
WHERE `notification_to` = '11'
---
    public function getNotifications($current_user){
        $builder = $this->db->table('notifications');
        $builder->select('*');
        $builder->where('notification_to', $current_user);
        $query = $builder->get();