app/Models/ProjectAssignModel.php

    public function fetch_data(){
        $builder = $this->db->table('project_assign');
        $builder->select(['user.username as Assigned_to','user2.username as assigned_by','projects.name as Project_name','project_assign.created_at as Assigned_Date','projects.id as project_id','user.id as user_id','project_assign.user_category','project_assign.completion_time as estimation_time','project_assign.work_description','projects.project_no','projects.project_category']);
        $builder->join(' user', 'project_assign.user_id =  user.id');
        $builder->join('user as user2', 'project_assign.assign_by =  user2.id');
        $builder->join('projects', 'project_assign.project_id = projects.id');
        $builder->where("(project_assign.project_deallocate = 'no' OR project_assign.project_deallocate IS NULL)");
        $builder->orderBy('project_assign.id', 'DESC');

        $query = $builder->get();
---
SELECT `user`.`username` as `Assigned_to`, `user2`.`username` as `assigned_by`, `projects`.`name` as `Project_name`, `project_assign`.`created_at` as `Assigned_Date`, `projects`.`id` as `project_id`, `user`.`id` as `user_id`, `project_assign`.`user_category`, `project_assign`.`completion_time` as `estimation_time`, `project_assign`.`work_description`, `projects`.`project_no`, `projects`.`project_category`
FROM `project_assign`
JOIN `user` ON `project_assign`.`user_id` =  `user`.`id`
JOIN `user` as `user2` ON `project_assign`.`assign_by` =  `user2`.`id`
JOIN `projects` ON `project_assign`.`project_id` = `projects`.`id`
WHERE (`project_assign`.`project_deallocate` = 'no' OR `project_assign`.`project_deallocate` IS NULL)
ORDER BY `project_assign`.`id` DESC

public function getAssignProjectList($current_user){
    $builder = $this->db->table('project_assign');
    $builder->select(['projects.name as Project_name','projects.id as Project_id' ,'projects.project_stage as project_stage','project_assign.created_at as assign_date','project_assign.work_description as description','projects.project_no','project_assign.completion_time','projects.project_category']);
    $builder->join('user', 'project_assign.user_id =  user.id');
    $builder->join('projects', 'project_assign.project_id = projects.id');
    $builder->where('user_id', $current_user);
    $builder->where('projects.project_status', 'Running');
    $builder->where('project_assign.project_deallocate', 'no');
    $query = $builder->get();
---
SELECT `projects`.`name` as `Project_name`, `projects`.`id` as `Project_id`, `projects`.`project_stage` as `project_stage`, `project_assign`.`created_at` as `assign_date`, `project_assign`.`work_description` as `description`, `projects`.`project_no`, `project_assign`.`completion_time`, `projects`.`project_category`
FROM `project_assign`
JOIN `user` ON `project_assign`.`user_id` =  `user`.`id`
JOIN `projects` ON `project_assign`.`project_id` = `projects`.`id`
WHERE `user_id` = '12'
AND `projects`.`project_status` = 'Running'
AND `project_assign`.`project_deallocate` = 'no'

public function getAllAssignProjectList($current_user) {
    $builder = $this->db->table('project_assign');
    $builder->select(['projects.name as Project_name','projects.id as Project_id' ,'projects.project_status','project_assign.created_at as assign_date','project_assign.work_description as description','projects.project_no','project_assign.completion_time','projects.project_category','projects.project_stage',
    'user2.username as assign_by','project_assign.user_category','project_assign.project_completed','project_deallocate'
]);
    $builder->join('user', 'project_assign.user_id =  user.id');
    $builder->join('user as user2 ', 'project_assign.assign_by =  user2.id');
    $builder->join('projects', 'project_assign.project_id = projects.id');
    $builder->where('user_id', $current_user);
    $builder->where("(`project_assign`.`project_deallocate` = 'no' OR (`project_assign`.`project_deallocate` = 'yes' AND `project_assign`.`project_completed` = 'yes'))");

    $query = $builder->get();
---
SELECT `projects`.`name` as `Project_name`, `projects`.`id` as `Project_id`, `projects`.`project_status`, `project_assign`.`created_at` as `assign_date`, `project_assign`.`work_description` as `description`, `projects`.`project_no`, `project_assign`.`completion_time`, `projects`.`project_category`, `projects`.`project_stage`, `user2`.`username` as `assign_by`, `project_assign`.`user_category`
FROM `project_assign`
JOIN `user` ON `project_assign`.`user_id` =  `user`.`id`
JOIN `user` as `user2` ON `project_assign`.`assign_by` =  `user2`.`id`
JOIN `projects` ON `project_assign`.`project_id` = `projects`.`id`
WHERE `user_id` = '69'
AND (`project_assign`.`project_deallocate` = 'no' OR (`project_assign`.`project_deallocate` = 'yes' AND `project_assign`.`project_completed` = 'yes'))

public function countAllAssignProject($login_user) {
    $builder = $this->db->table('project_assign');
$builder->select('*');
$builder->join('projects', 'project_assign.project_id = projects.id');
$builder->where('project_assign.user_id', $login_user);
$builder->groupStart()
    ->where('project_assign.project_deallocate', 'no')
    ->orWhere('project_assign.project_deallocate', 'yes')
        ->where('project_assign.project_completed', 'yes')
    ->groupEnd();
$query = $builder->get();
$result = $query->getResult();
$countAll = count($result);

    $builder->select('*');
    $builder->join('projects', 'project_assign.project_id = projects.id');
    $builder->where('projects.project_status', 'Running');
    $builder->where('project_assign.user_id', $login_user);
    $builder->where('project_assign.project_deallocate', 'no');
    $query = $builder->get();
    $result = $query->getResult();
    $countRunning = count($result);

    $builder->select('*');
    $builder->join('projects', 'project_assign.project_id = projects.id');
    $builder->where('projects.project_status', 'Completed');
    $builder->where('project_assign.user_id', $login_user);
    $builder->where('project_assign.project_completed', 'yes');

    $query = $builder->get();
---
SELECT *
FROM `project_assign`
JOIN `projects` ON `project_assign`.`project_id` = `projects`.`id`
WHERE `project_assign`.`user_id` = '11'
AND   (
`project_assign`.`project_deallocate` = 'no'
OR `project_assign`.`project_deallocate` = 'yes'
AND `project_assign`.`project_completed` = 'yes'
 )
SELECT *
FROM `project_assign`
JOIN `projects` ON `project_assign`.`project_id` = `projects`.`id`
WHERE `projects`.`project_status` = 'Running'
AND `project_assign`.`user_id` = '11'
AND `project_assign`.`project_deallocate` = 'no'
SELECT *
FROM `project_assign`
JOIN `projects` ON `project_assign`.`project_id` = `projects`.`id`
WHERE `projects`.`project_status` = 'Completed'
AND `project_assign`.`user_id` = '11'
AND `project_assign`.`project_completed` = 'yes'