app/Models/TaskModel.php

    public function verifyTask($login_user,$task_id){
        $builder = $this->db->table('task_assign');
        $builder->select('*');
        $builder->where('assign_to', $login_user);
        $builder->where('id', $task_id);
        $query = $builder->get();
---
SELECT *
FROM `task_assign`
WHERE `assign_to` = '11'
AND `id` = '44'