app/Models/TimeModel.php

SELECT `time_entries`.`project_id`, `projects`.`name` as `Project_name`, `time_entries`.`date`, `time_entries`.`time`, `time_entries`.`description`, `task_assign`.`task_name`, `time_entries`.`entries_for`, `work_description_for_proxy`
FROM `time_entries`
LEFT JOIN `projects` ON `projects`.`id` = `time_entries`.`project_id`
LEFT JOIN `task_assign` ON `task_assign`.`id` = `time_entries`.`task_id`
WHERE `time_entries`.`user_id` = '69'
AND `time_entries`.`date` = '2023-05-22'
---
    function get_data($user_id,$date){
        $builder = $this->db->table('time_entries');
        $builder->select(['time_entries.task_id as task_id','time_entries.id as entries_id','time_entries.project_id', 'projects.name as Project_name','time_entries.date','time_entries.time','time_entries.description','task_assign.task_name','time_entries.entries_for','work_description_for_proxy','time_entries.is_edit']);
        $builder->join('projects', 'projects.id = time_entries.project_id', 'left');
        $builder->join('task_assign', 'task_assign.id = time_entries.task_id', 'left');
        $builder->where('time_entries.user_id', $user_id);
        $builder->where('time_entries.date', $date);
        $query = $builder->get();