app/Models/UsersModel.php

SELECT `projects`.`name` as `Project_Name`, `time_entries`.`date` as `Worked_on`, `time_entries`.`time` as `Total_spent_time`, `time_entries`.`description` as `Work_Description`, `project_assign`.`created_at` as `assigned_on`, `project_assign`.`deallocate_at` as `deallocate`
FROM `time_entries`
JOIN `user` ON `time_entries`.`user_id` =  `user`.`id`
JOIN `projects` ON `time_entries`.`project_id` = `projects`.`id`
JOIN `project_assign` ON `project_assign`.`project_id` = `projects`.`id`
WHERE `user`.`id` = '11'
AND `projects`.`id` = '48'
GROUP BY `time_entries`.`id`
---
function getTimeEntries($search_user, $project_id) {
    $builder = $this->db->table('time_entries');
    $builder->select(['projects.name as Project_Name','time_entries.date as Worked_on','time_entries.time as Total_spent_time','time_entries.description as Work_Description','project_assign.created_at as assigned_on', 'project_assign.deallocate_at as deallocate']);
    $builder->join('user', 'time_entries.user_id =  user.id');
    $builder->join('projects', 'time_entries.project_id = projects.id');
    $builder->join('project_assign', 'project_assign.project_id = projects.id');
    $builder->where('user.id', $search_user);
    $builder->where('projects.id', $project_id);
    $builder->groupBy('time_entries.id');

    $query = $builder->get();